Autodesk.Revit.UI.FamilyInstancePlacingArgs.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.FamilyInstancePlacingArgs.TooltipMessage
The message to be shown via tooltip
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.FamilyInstancePlacingArgs.StatusMessage
The message to be shown on the status bar
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.FamilyInstancePlacingArgs.IsBanned
Indicates if the cursor is banned or not.
Since:
2017

Autodesk.Revit.UI.FamilyInstancePlacingArgs.ActiveView
The active view
Since:
2017

Autodesk.Revit.UI.FamilyInstancePlacingArgs
The class is used to access necessary data during the placement of a FamilyInstance.
Since:
2017